thonv54/IR-PIR/Project_Headers/mc9s08pt16.h
extern volatile TSI_CS0STR _TSI_CS0 @0x00000008;
#define TSI_CS0                         _TSI_CS0.Byte
#define TSI_CS0_SWTS                    _TSI_CS0.Bits.SWTS
#define TSI_CS0_CURSW                   _TSI_CS0.Bits.CURSW
#define TSI_CS0_EOSF                    _TSI_CS0.Bits.EOSF
#define TSI_CS0_SCNIP                   _TSI_CS0.Bits.SCNIP
#define TSI_CS0_STM                     _TSI_CS0.Bits.STM
#define TSI_CS0_STPE                    _TSI_CS0.Bits.STPE
#define TSI_CS0_TSIIEN                  _TSI_CS0.Bits.TSIIEN
#define TSI_CS0_TSIEN                   _TSI_CS0.Bits.TSIEN
/* TSI_CS_ARR: Access 4 TSI_CSx registers in an array */
#define TSI_CS_ARR                      ((volatile byte * __far) &TSI_CS0)

#define TSI_CS0_SWTS_MASK               1U
#define TSI_CS0_CURSW_MASK              2U
#define TSI_CS0_EOSF_MASK               4U
#define TSI_CS0_SCNIP_MASK              8U
#define TSI_CS0_STM_MASK                16U
#define TSI_CS0_STPE_MASK               32U
#define TSI_CS0_TSIIEN_MASK             64U
#define TSI_CS0_TSIEN_MASK              128U


/*** TSI_CS1 - TSI Control and Status Register 1; 0x00000009 ***/
typedef union {
  byte Byte;
  struct {
    byte NSCN0       :1;                                       /* NSCN, bit 0 */
    byte NSCN1       :1;                                       /* NSCN, bit 1 */
    byte NSCN2       :1;                                       /* NSCN, bit 2 */
    byte NSCN3       :1;                                       /* NSCN, bit 3 */
    byte NSCN4       :1;                                       /* NSCN, bit 4 */
    byte PS0         :1;                                       /* PS, bit 0 */
    byte PS1         :1;                                       /* PS, bit 1 */
    byte PS2         :1;                                       /* PS, bit 2 */
  } Bits;
  struct {
    byte grpNSCN :5;
    byte grpPS   :3;
  } MergedBits;
} TSI_CS1STR;
extern volatile TSI_CS1STR _TSI_CS1 @0x00000009;
#define TSI_CS1                         _TSI_CS1.Byte
#define TSI_CS1_NSCN0                   _TSI_CS1.Bits.NSCN0
#define TSI_CS1_NSCN1                   _TSI_CS1.Bits.NSCN1
#define TSI_CS1_NSCN2                   _TSI_CS1.Bits.NSCN2
#define TSI_CS1_NSCN3                   _TSI_CS1.Bits.NSCN3
#define TSI_CS1_NSCN4                   _TSI_CS1.Bits.NSCN4
#define TSI_CS1_PS0                     _TSI_CS1.Bits.PS0
#define TSI_CS1_PS1                     _TSI_CS1.Bits.PS1
#define TSI_CS1_PS2                     _TSI_CS1.Bits.PS2
#define TSI_CS1_NSCN                    _TSI_CS1.MergedBits.grpNSCN
#define TSI_CS1_PS                      _TSI_CS1.MergedBits.grpPS

#define TSI_CS1_NSCN0_MASK              1U
#define TSI_CS1_NSCN1_MASK              2U
#define TSI_CS1_NSCN2_MASK              4U
#define TSI_CS1_NSCN3_MASK              8U
#define TSI_CS1_NSCN4_MASK              16U
#define TSI_CS1_PS0_MASK                32U
#define TSI_CS1_PS1_MASK                64U
#define TSI_CS1_PS2_MASK                128U
#define TSI_CS1_NSCN_MASK               31U
#define TSI_CS1_NSCN_BITNUM             0U
#define TSI_CS1_PS_MASK                 224U
#define TSI_CS1_PS_BITNUM               5U


/*** TSI_CS2 - TSI Control and Status Register 2; 0x0000000A ***/
typedef union {
  byte Byte;
  struct {
    byte EXTCHRG0    :1;                                       /* EXTCHRG, bit 0 */
    byte EXTCHRG1    :1;                                       /* EXTCHRG, bit 1 */
    byte EXTCHRG2    :1;                                       /* EXTCHRG, bit 2 */
    byte DVOLT0      :1;                                       /* DVOLT, bit 0 */
    byte DVOLT1      :1;                                       /* DVOLT, bit 1 */
    byte REFCHRG0    :1;                                       /* REFCHRG, bit 0 */
    byte REFCHRG1    :1;                                       /* REFCHRG, bit 1 */
    byte REFCHRG2    :1;                                       /* REFCHRG, bit 2 */
  } Bits;
  struct {
    byte grpEXTCHRG :3;
    byte grpDVOLT :2;
    byte grpREFCHRG :3;
  } MergedBits;
} TSI_CS2STR;
extern volatile TSI_CS2STR _TSI_CS2 @0x0000000A;
#define TSI_CS2                         _TSI_CS2.Byte
#define TSI_CS2_EXTCHRG0                _TSI_CS2.Bits.EXTCHRG0
#define TSI_CS2_EXTCHRG1                _TSI_CS2.Bits.EXTCHRG1
#define TSI_CS2_EXTCHRG2                _TSI_CS2.Bits.EXTCHRG2
#define TSI_CS2_DVOLT0                  _TSI_CS2.Bits.DVOLT0
#define TSI_CS2_DVOLT1                  _TSI_CS2.Bits.DVOLT1
#define TSI_CS2_REFCHRG0                _TSI_CS2.Bits.REFCHRG0
#define TSI_CS2_REFCHRG1                _TSI_CS2.Bits.REFCHRG1
#define TSI_CS2_REFCHRG2                _TSI_CS2.Bits.REFCHRG2
#define TSI_CS2_EXTCHRG                 _TSI_CS2.MergedBits.grpEXTCHRG
#define TSI_CS2_DVOLT                   _TSI_CS2.MergedBits.grpDVOLT
#define TSI_CS2_REFCHRG                 _TSI_CS2.MergedBits.grpREFCHRG

#define TSI_CS2_EXTCHRG0_MASK           1U
#define TSI_CS2_EXTCHRG1_MASK           2U
#define TSI_CS2_EXTCHRG2_MASK           4U
#define TSI_CS2_DVOLT0_MASK             8U
#define TSI_CS2_DVOLT1_MASK             16U
#define TSI_CS2_REFCHRG0_MASK           32U
#define TSI_CS2_REFCHRG1_MASK           64U
#define TSI_CS2_REFCHRG2_MASK           128U
#define TSI_CS2_EXTCHRG_MASK            7U
#define TSI_CS2_EXTCHRG_BITNUM          0U
#define TSI_CS2_DVOLT_MASK              24U
#define TSI_CS2_DVOLT_BITNUM            3U
#define TSI_CS2_REFCHRG_MASK            224U
#define TSI_CS2_REFCHRG_BITNUM          5U


/*** TSI_CS3 - TSI Control and Status Register 3; 0x0000000B ***/
typedef union {
  byte Byte;
  struct {
    byte STAT_STUP0  :1;                                       /* STAT/STU, bit 0 */
    byte STAT_STUP1  :1;                                       /* STAT/STU, bit 1 */
    byte STAT_STUP2  :1;                                       /* STAT/STU, bit 2 */
    byte STAT_STUP3  :1;                                       /* STAT/STU, bit 3 */
    byte TSICH0      :1;                                       /* TSICH, bit 0 */
    byte TSICH1      :1;                                       /* TSICH, bit 1 */
    byte TSICH2      :1;                                       /* TSICH, bit 2 */
    byte TSICH3      :1;                                       /* TSICH, bit 3 */
  } Bits;
  struct {
    byte grpSTAT_STUP :4;
    byte grpTSICH :4;
  } MergedBits;
} TSI_CS3STR;
extern volatile TSI_CS3STR _TSI_CS3 @0x0000000B;
#define TSI_CS3                         _TSI_CS3.Byte
#define TSI_CS3_STAT_STUP0              _TSI_CS3.Bits.STAT_STUP0
#define TSI_CS3_STAT_STUP1              _TSI_CS3.Bits.STAT_STUP1
#define TSI_CS3_STAT_STUP2              _TSI_CS3.Bits.STAT_STUP2
#define TSI_CS3_STAT_STUP3              _TSI_CS3.Bits.STAT_STUP3
#define TSI_CS3_TSICH0                  _TSI_CS3.Bits.TSICH0
#define TSI_CS3_TSICH1                  _TSI_CS3.Bits.TSICH1
#define TSI_CS3_TSICH2                  _TSI_CS3.Bits.TSICH2
#define TSI_CS3_TSICH3                  _TSI_CS3.Bits.TSICH3
#define TSI_CS3_STAT_STUP               _TSI_CS3.MergedBits.grpSTAT_STUP
#define TSI_CS3_TSICH                   _TSI_CS3.MergedBits.grpTSICH

#define TSI_CS3_STAT_STUP0_MASK         1U
#define TSI_CS3_STAT_STUP1_MASK         2U
#define TSI_CS3_STAT_STUP2_MASK         4U
#define TSI_CS3_STAT_STUP3_MASK         8U
#define TSI_CS3_TSICH0_MASK             16U
#define TSI_CS3_TSICH1_MASK             32U
#define TSI_CS3_TSICH2_MASK             64U
#define TSI_CS3_TSICH3_MASK             128U
#define TSI_CS3_STAT_STUP_MASK          15U
#define TSI_CS3_STAT_STUP_BITNUM        0U
#define TSI_CS3_TSICH_MASK              240U
#define TSI_CS3_TSICH_BITNUM            4U


