thonv54/IR-PIR/Project_Headers/mc9s08pt16.h
#define SCI1_D_R0T0_MASK                1U
#define SCI1_D_R1T1_MASK                2U
#define SCI1_D_R2T2_MASK                4U
#define SCI1_D_R3T3_MASK                8U
#define SCI1_D_R4T4_MASK                16U
#define SCI1_D_R5T5_MASK                32U
#define SCI1_D_R6T6_MASK                64U
#define SCI1_D_R7T7_MASK                128U


/*** SPI0_C1 - SPI control register 1; 0x00003098 ***/
typedef union {
  byte Byte;
  struct {
    byte LSBFE       :1;                                       /* LSB first (shifter direction) */
    byte SSOE        :1;                                       /* Slave select output enable */
    byte CPHA        :1;                                       /* Clock phase */
    byte CPOL        :1;                                       /* Clock polarity */
    byte MSTR        :1;                                       /* Master/slave mode select */
    byte SPTIE       :1;                                       /* SPI transmit interrupt enable */
    byte SPE         :1;                                       /* SPI system enable */
    byte SPIE        :1;                                       /* SPI interrupt enable: for SPRF and MODF */
  } Bits;
} SPI0_C1STR;
extern volatile SPI0_C1STR _SPI0_C1 @0x00003098;
#define SPI0_C1                         _SPI0_C1.Byte
#define SPI0_C1_LSBFE                   _SPI0_C1.Bits.LSBFE
#define SPI0_C1_SSOE                    _SPI0_C1.Bits.SSOE
#define SPI0_C1_CPHA                    _SPI0_C1.Bits.CPHA
#define SPI0_C1_CPOL                    _SPI0_C1.Bits.CPOL
#define SPI0_C1_MSTR                    _SPI0_C1.Bits.MSTR
#define SPI0_C1_SPTIE                   _SPI0_C1.Bits.SPTIE
#define SPI0_C1_SPE                     _SPI0_C1.Bits.SPE
#define SPI0_C1_SPIE                    _SPI0_C1.Bits.SPIE

#define SPI0_C1_LSBFE_MASK              1U
#define SPI0_C1_SSOE_MASK               2U
#define SPI0_C1_CPHA_MASK               4U
#define SPI0_C1_CPOL_MASK               8U
#define SPI0_C1_MSTR_MASK               16U
#define SPI0_C1_SPTIE_MASK              32U
#define SPI0_C1_SPE_MASK                64U
#define SPI0_C1_SPIE_MASK               128U


/*** SPI0_C2 - SPI control register 2; 0x00003099 ***/
typedef union {
  byte Byte;
  struct {
    byte SPC0        :1;                                       /* SPI pin control 0 */
    byte SPISWAI     :1;                                       /* SPI stop in wait mode */
    byte             :1; 
    byte BIDIROE     :1;                                       /* Bidirectional mode output enable */
    byte MODFEN      :1;                                       /* Master mode-fault function enable */
    byte             :1; 
    byte             :1; 
    byte SPMIE       :1;                                       /* SPI match interrupt enable */
  } Bits;
} SPI0_C2STR;
extern volatile SPI0_C2STR _SPI0_C2 @0x00003099;
#define SPI0_C2                         _SPI0_C2.Byte
#define SPI0_C2_SPC0                    _SPI0_C2.Bits.SPC0
#define SPI0_C2_SPISWAI                 _SPI0_C2.Bits.SPISWAI
#define SPI0_C2_BIDIROE                 _SPI0_C2.Bits.BIDIROE
#define SPI0_C2_MODFEN                  _SPI0_C2.Bits.MODFEN
#define SPI0_C2_SPMIE                   _SPI0_C2.Bits.SPMIE

#define SPI0_C2_SPC0_MASK               1U
#define SPI0_C2_SPISWAI_MASK            2U
#define SPI0_C2_BIDIROE_MASK            8U
#define SPI0_C2_MODFEN_MASK             16U
#define SPI0_C2_SPMIE_MASK              128U


/*** SPI0_BR - SPI baud rate register; 0x0000309A ***/
typedef union {
  byte Byte;
  struct {
    byte SPR0        :1;                                       /* SPI baud rate divisor, bit 0 */
    byte SPR1        :1;                                       /* SPI baud rate divisor, bit 1 */
    byte SPR2        :1;                                       /* SPI baud rate divisor, bit 2 */
    byte SPR3        :1;                                       /* SPI baud rate divisor, bit 3 */
    byte SPPR0       :1;                                       /* SPI baud rate prescale divisor, bit 0 */
    byte SPPR1       :1;                                       /* SPI baud rate prescale divisor, bit 1 */
    byte SPPR2       :1;                                       /* SPI baud rate prescale divisor, bit 2 */
    byte             :1; 
  } Bits;
  struct {
    byte grpSPR  :4;
    byte grpSPPR :3;
    byte         :1;
  } MergedBits;
} SPI0_BRSTR;
extern volatile SPI0_BRSTR _SPI0_BR @0x0000309A;
#define SPI0_BR                         _SPI0_BR.Byte
#define SPI0_BR_SPR0                    _SPI0_BR.Bits.SPR0
#define SPI0_BR_SPR1                    _SPI0_BR.Bits.SPR1
#define SPI0_BR_SPR2                    _SPI0_BR.Bits.SPR2
#define SPI0_BR_SPR3                    _SPI0_BR.Bits.SPR3
#define SPI0_BR_SPPR0                   _SPI0_BR.Bits.SPPR0
#define SPI0_BR_SPPR1                   _SPI0_BR.Bits.SPPR1
#define SPI0_BR_SPPR2                   _SPI0_BR.Bits.SPPR2
#define SPI0_BR_SPR                     _SPI0_BR.MergedBits.grpSPR
#define SPI0_BR_SPPR                    _SPI0_BR.MergedBits.grpSPPR

#define SPI0_BR_SPR0_MASK               1U
#define SPI0_BR_SPR1_MASK               2U
#define SPI0_BR_SPR2_MASK               4U
#define SPI0_BR_SPR3_MASK               8U
#define SPI0_BR_SPPR0_MASK              16U
#define SPI0_BR_SPPR1_MASK              32U
#define SPI0_BR_SPPR2_MASK              64U
#define SPI0_BR_SPR_MASK                15U
#define SPI0_BR_SPR_BITNUM              0U
#define SPI0_BR_SPPR_MASK               112U
#define SPI0_BR_SPPR_BITNUM             4U


/*** SPI0_S - SPI status register; 0x0000309B ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte MODF        :1;                                       /* Master mode fault flag */
    byte SPTEF       :1;                                       /* SPI transmit buffer empty flag */
    byte SPMF        :1;                                       /* SPI match flag */
    byte SPRF        :1;                                       /* SPI read buffer full flag */
  } Bits;
} SPI0_SSTR;
